{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["sequential_2", 1, 0]], "name": "model_2", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "name": "input_3", "sparse": false}, "name": "input_3"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Embedding", "config": {"mask_zero": false, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_length": null, "trainable": true, "activity_regularizer": null, "input_dim": 15, "embeddings_regularizer": null, "name": "embedding_1", "embeddings_constraint": null, "batch_input_shape": [null, null], "dtype": "float32"}, "name": "embedding_1"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "name": "input_2", "sparse": false}, "name": "input_2"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "name": "flatten_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Multiply", "config": {"trainable": true, "name": "multiply_1"}, "name": "multiply_1"}, {"inbound_nodes": [[["multiply_1", 0, 0, {}]]], "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "batch_input_shape": [null, 100], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "units": 8192, "bias_constraint": null, "dtype": "float32", "use_bias": true}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [4, 4, 512], "name": "reshape_1"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_constraint": null, "scale": true, "center": true, "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 512, "strides": [1, 1], "trainable": true, "activation": "linear", "name": "conv2d_5", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_constraint": null, "scale": true, "center": true, "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 256, "strides": [1, 1], "trainable": true, "activation": "linear", "name": "conv2d_6", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_constraint": null, "scale": true, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 128, "strides": [1, 1], "trainable": true, "activation": "linear", "name": "conv2d_7", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_constraint": null, "scale": true, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "strides": [1, 1], "trainable": true, "activation": "linear", "name": "conv2d_8", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_constraint": null, "scale": true, "center": true, "axis": -1, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 3, "strides": [1, 1], "trainable": true, "activation": "linear", "name": "conv2d_9", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "tanh"}}], "name": "sequential_2"}]}}